RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6300/ip/hpm_enet_regs.h
/*
 * TXUFLOWERFIS (RW)
 *
 * MMC Transmit Underflow Error Frame Counter Interrupt Status
 * This bit is set when the txunderflowerror counter reaches half of the maximum value or the maximum value.
 */
#define ENET_MMC_INTR_TX_TXUFLOWERFIS_MASK (0x2000U)
#define ENET_MMC_INTR_TX_TXUFLOWERFIS_SHIFT (13U)
#define ENET_MMC_INTR_TX_TXUFLOWERFIS_SET(x) (((uint32_t)(x) << ENET_MMC_INTR_TX_TXUFLOWERFIS_SHIFT) & ENET_MMC_INTR_TX_TXUFLOWERFIS_MASK)
#define ENET_MMC_INTR_TX_TXUFLOWERFIS_GET(x) (((uint32_t)(x) & ENET_MMC_INTR_TX_TXUFLOWERFIS_MASK) >> ENET_MMC_INTR_TX_TXUFLOWERFIS_SHIFT)

/*
 * TXBCGBFIS (RW)
 *
 * MMC Transmit Broadcast Good Bad Frame Counter Interrupt Status
 * This bit is set when the txbroadcastframes_gb counter reaches half of the maximum value or the maximum value.
 */
#define ENET_MMC_INTR_TX_TXBCGBFIS_MASK (0x1000U)
#define ENET_MMC_INTR_TX_TXBCGBFIS_SHIFT (12U)
#define ENET_MMC_INTR_TX_TXBCGBFIS_SET(x) (((uint32_t)(x) << ENET_MMC_INTR_TX_TXBCGBFIS_SHIFT) & ENET_MMC_INTR_TX_TXBCGBFIS_MASK)
#define ENET_MMC_INTR_TX_TXBCGBFIS_GET(x) (((uint32_t)(x) & ENET_MMC_INTR_TX_TXBCGBFIS_MASK) >> ENET_MMC_INTR_TX_TXBCGBFIS_SHIFT)

/*
 * TXMCGBFIS (RW)
 *
 * MMC Transmit Multicast Good Bad Frame Counter Interrupt Status
 * The bit is set when the txmulticastframes_gb counter reaches half of the maximum value or the maximum value.
 */
#define ENET_MMC_INTR_TX_TXMCGBFIS_MASK (0x800U)
#define ENET_MMC_INTR_TX_TXMCGBFIS_SHIFT (11U)
#define ENET_MMC_INTR_TX_TXMCGBFIS_SET(x) (((uint32_t)(x) << ENET_MMC_INTR_TX_TXMCGBFIS_SHIFT) & ENET_MMC_INTR_TX_TXMCGBFIS_MASK)
#define ENET_MMC_INTR_TX_TXMCGBFIS_GET(x) (((uint32_t)(x) & ENET_MMC_INTR_TX_TXMCGBFIS_MASK) >> ENET_MMC_INTR_TX_TXMCGBFIS_SHIFT)

/*
 * TXUCGBFIS (RW)
 *
 * MMC Transmit Unicast Good Bad Frame Counter Interrupt Status
 * This bit is set when the txunicastframes_gb counter reaches half of the maximum value or the maximum value.
 */
#define ENET_MMC_INTR_TX_TXUCGBFIS_MASK (0x400U)
#define ENET_MMC_INTR_TX_TXUCGBFIS_SHIFT (10U)
#define ENET_MMC_INTR_TX_TXUCGBFIS_SET(x) (((uint32_t)(x) << ENET_MMC_INTR_TX_TXUCGBFIS_SHIFT) & ENET_MMC_INTR_TX_TXUCGBFIS_MASK)
#define ENET_MMC_INTR_TX_TXUCGBFIS_GET(x) (((uint32_t)(x) & ENET_MMC_INTR_TX_TXUCGBFIS_MASK) >> ENET_MMC_INTR_TX_TXUCGBFIS_SHIFT)

/*
 * TX1024TMAXOCTGBFIS (RW)
 *
 * MMC Transmit 1024 to Maximum Octet Good Bad Frame Counter Interrupt Status
 * This bit is set when the tx1024tomaxoctets_gb counter reaches half of the maximum value or the maximum value.
 */
#define ENET_MMC_INTR_TX_TX1024TMAXOCTGBFIS_MASK (0x200U)
#define ENET_MMC_INTR_TX_TX1024TMAXOCTGBFIS_SHIFT (9U)
#define ENET_MMC_INTR_TX_TX1024TMAXOCTGBFIS_SET(x) (((uint32_t)(x) << ENET_MMC_INTR_TX_TX1024TMAXOCTGBFIS_SHIFT) & ENET_MMC_INTR_TX_TX1024TMAXOCTGBFIS_MASK)
#define ENET_MMC_INTR_TX_TX1024TMAXOCTGBFIS_GET(x) (((uint32_t)(x) & ENET_MMC_INTR_TX_TX1024TMAXOCTGBFIS_MASK) >> ENET_MMC_INTR_TX_TX1024TMAXOCTGBFIS_SHIFT)

/*
 * TX512T1023OCTGBFIS (RW)
 *
 * MMC Transmit 512 to 1023 Octet Good Bad Frame Counter Interrupt Status
 * This bit is set when the tx512to1023octets_gb counter reaches half of the maximum value or the maximum value.
 */
#define ENET_MMC_INTR_TX_TX512T1023OCTGBFIS_MASK (0x100U)
#define ENET_MMC_INTR_TX_TX512T1023OCTGBFIS_SHIFT (8U)
#define ENET_MMC_INTR_TX_TX512T1023OCTGBFIS_SET(x) (((uint32_t)(x) << ENET_MMC_INTR_TX_TX512T1023OCTGBFIS_SHIFT) & ENET_MMC_INTR_TX_TX512T1023OCTGBFIS_MASK)
#define ENET_MMC_INTR_TX_TX512T1023OCTGBFIS_GET(x) (((uint32_t)(x) & ENET_MMC_INTR_TX_TX512T1023OCTGBFIS_MASK) >> ENET_MMC_INTR_TX_TX512T1023OCTGBFIS_SHIFT)

/*
 * TX256T511OCTGBFIS (RW)
 *
 * MMC Transmit 256 to 511 Octet Good Bad Frame Counter Interrupt Status
 * This bit is set when the tx256to511octets_gb counter reaches half of the maximum value or the maximum value.
 */
#define ENET_MMC_INTR_TX_TX256T511OCTGBFIS_MASK (0x80U)
#define ENET_MMC_INTR_TX_TX256T511OCTGBFIS_SHIFT (7U)
#define ENET_MMC_INTR_TX_TX256T511OCTGBFIS_SET(x) (((uint32_t)(x) << ENET_MMC_INTR_TX_TX256T511OCTGBFIS_SHIFT) & ENET_MMC_INTR_TX_TX256T511OCTGBFIS_MASK)
#define ENET_MMC_INTR_TX_TX256T511OCTGBFIS_GET(x) (((uint32_t)(x) & ENET_MMC_INTR_TX_TX256T511OCTGBFIS_MASK) >> ENET_MMC_INTR_TX_TX256T511OCTGBFIS_SHIFT)

/*
 * TX128T255OCTGBFIS (RW)
 *
 * MMC Transmit 128 to 255 Octet Good Bad Frame Counter Interrupt Status
 * This bit is set when the tx128to255octets_gb counter reaches half of the maximum value or the maximum value.
 */
#define ENET_MMC_INTR_TX_TX128T255OCTGBFIS_MASK (0x40U)
#define ENET_MMC_INTR_TX_TX128T255OCTGBFIS_SHIFT (6U)
#define ENET_MMC_INTR_TX_TX128T255OCTGBFIS_SET(x) (((uint32_t)(x) << ENET_MMC_INTR_TX_TX128T255OCTGBFIS_SHIFT) & ENET_MMC_INTR_TX_TX128T255OCTGBFIS_MASK)
#define ENET_MMC_INTR_TX_TX128T255OCTGBFIS_GET(x) (((uint32_t)(x) & ENET_MMC_INTR_TX_TX128T255OCTGBFIS_MASK) >> ENET_MMC_INTR_TX_TX128T255OCTGBFIS_SHIFT)

/*
 * TX65T127OCTGBFIS (RW)
 *
 * MMC Transmit 65 to 127 Octet Good Bad Frame Counter Interrupt Status
 * This bit is set when the tx65to127octets_gb counter reaches half the maximum value, and also when it reaches the maximum value.
 */
#define ENET_MMC_INTR_TX_TX65T127OCTGBFIS_MASK (0x20U)
#define ENET_MMC_INTR_TX_TX65T127OCTGBFIS_SHIFT (5U)
#define ENET_MMC_INTR_TX_TX65T127OCTGBFIS_SET(x) (((uint32_t)(x) << ENET_MMC_INTR_TX_TX65T127OCTGBFIS_SHIFT) & ENET_MMC_INTR_TX_TX65T127OCTGBFIS_MASK)
#define ENET_MMC_INTR_TX_TX65T127OCTGBFIS_GET(x) (((uint32_t)(x) & ENET_MMC_INTR_TX_TX65T127OCTGBFIS_MASK) >> ENET_MMC_INTR_TX_TX65T127OCTGBFIS_SHIFT)

/*
 * TX64OCTGBFIS (RW)
 *
 * MMC Transmit 64 Octet Good Bad Frame Counter Interrupt Status
 * This bit is set when the tx64octets_gb counter reaches half of the maximum value or the maximum value.
 */
#define ENET_MMC_INTR_TX_TX64OCTGBFIS_MASK (0x10U)
#define ENET_MMC_INTR_TX_TX64OCTGBFIS_SHIFT (4U)
#define ENET_MMC_INTR_TX_TX64OCTGBFIS_SET(x) (((uint32_t)(x) << ENET_MMC_INTR_TX_TX64OCTGBFIS_SHIFT) & ENET_MMC_INTR_TX_TX64OCTGBFIS_MASK)
#define ENET_MMC_INTR_TX_TX64OCTGBFIS_GET(x) (((uint32_t)(x) & ENET_MMC_INTR_TX_TX64OCTGBFIS_MASK) >> ENET_MMC_INTR_TX_TX64OCTGBFIS_SHIFT)

